[
    {
        "id": 1,
        "title": "Web Design Fundamentals",
        "image": "",
        "duration": "4 Weeks",
        "level": "Beginner",
        "instructor": "John Smith",
        "description": "Learn the fundamentals of web design, including HTML, CSS, and responsive design principles. Develop the skills to create visually appealing and user-friendly websites."
    },
    {
        "id": 2,
        "title": "UI/UX Design",
        "image": "",
        "duration": "6 Weeks",
        "level": "Intermediate",
        "instructor": "Emily Johnson",
        "description": "Master the art of creating intuitive user interfaces (UI) and enhancing user experiences (UX). Learn design principles, wireframing, prototyping, and usability testing techniques."
    },
    {
        "id": 3,
        "title": "Mobile App Development",
        "image": "",
        "duration": "8 Weeks",
        "level": "Intermediate",
        "instructor": "David Brown",
        "description": "Dive into the world of mobile app development. Learn to build native iOS and Android applications using industry-leading frameworks like Swift and Kotlin."
    },
    {
        "id": 4,
        "title": "Graphic Design for Beginners",
        "image": "",
        "duration": "10 Weeks",
        "level": "Beginner",
        "instructor": "Sarah Thompson",
        "description": "Discover the fundamentals of graphic design, including typography, color theory, layout design, and image manipulation techniques. Create visually stunning designs for print and digital media."
    },
    {
        "id": 5,
        "title": "Front-End Web Development",
        "image": "",
        "duration": "10 Weeks",
        "level": "Intermediate",
        "instructor": "Michael Adams",
        "description": "Become proficient in front-end web development. Learn HTML, CSS, JavaScript, and popular frameworks like Bootstrap and React. Build interactive and responsive websites."
    },
    {
        "id": 6,
        "title": "Advanced JavaScript",
        "image": "",
        "duration": "6 Weeks",
        "level": "Advance",
        "instructor": "Jennifer Wilson",
        "description": "Take your JavaScript skills to the next level. Explore advanced concepts like closures, prototypes, asynchronous programming, and ES6 features. Build complex applications with confidence."
    }
]